import park from  "./assets/park.jpg"
import president from  "./assets/1president.jpg"
import koktobe from  "./assets/koktobe.png"
import medeu from "./assets/medeu.jpg";
import m from  "./assets/m.jpg"


export const columns = [
    { key: "day", label: "День" },
    { key: "distance", label: "Дистанция (км)" },
    { key: "time", label: "Время" },
    { key: "event", label: "Маршрут" },
    { key: "place", label: "Локация" },
    { key: "address", label: "Адрес" },
];

export const tables = [
    [
        { day: 1, distance: "20 км", time: "09:00–12:00", event: "Старт: Парк Первого Президента → Ботанический сад", place: "Парк Первого Президента", address: "проспект Аль-Фараби, 53" },
        { day: '', distance: "", time: "12:00–14:00", event: "Пешая прогулка, автономный обед", place: "Ботанический сад", address: "—" },
        { day: '', distance: "", time: "14:30–18:00", event: "Переход в Центральный парк → набережная реки Есентай", place: "Центральный парк", address: "ул. Гоголя, 1" },

        { day: 2, distance: "18 км", time: "08:00–10:30", event: "Переход через Аллею Конституции к Панфиловскому парку", place: "Аллея Конституции", address: "ул. Желтоксан" },
        { day: '', distance: "", time: "10:30–12:30", event: "Вознесенский собор → Музей народных инструментов", place: "Вознесенский собор", address: "ул. Гоголя, 40" },
        { day: '', distance: "", time: "13:00–18:00", event: "Арбат (проспект Жибек Жолы) → Зеленый базар", place: "Арбат", address: "проспект Жибек Жолы" },

        { day: 3, distance: "19 км", time: "08:00–12:00", event: "Подъем пешком на Кок-Тобе через ул. Достык", place: "Кок-Тобе", address: "проспект Достык, 104Б" },
        { day: '', distance: "", time: "12:00–14:00", event: "Отдых, автономный обед, обзор панорамы", place: "Кок-Тобе", address: "—" },
        { day: '', distance: "", time: "14:30–16:30", event: "Спуск по тропе в сторону Медеуской трассы", place: "Окрестности Кок-Тобе", address: "—" },

        { day: 4, distance: "21 км", time: "08:00–11:00", event: "Переход к набережной Малой Алматинки → Парк Горького", place: "Парк Горького", address: "ул. Гоголя, 1" },
        { day: '', distance: "", time: "11:30–13:00", event: "Переход к району Жетысу", place: "Район Жетысу", address: "северная часть Алматы" },
        { day: '', distance: "", time: "14:30–18:00", event: "Пеший маршрут по проспекту Абая", place: "Проспект Абая", address: "центральная улица Алматы" },

        { day: 5, distance: "17 км", time: "08:00–11:00", event: "Национальная библиотека → Театр оперы и балета", place: "Национальная библиотека", address: "ул. Абая, 14" },
        { day: '', distance: "", time: "11:30–14:00", event: "Старый город → Дворец Республики", place: "Дворец Республики", address: "площадь Республики, 1" },
        { day: '', distance: "", time: "14:30–18:00", event: "Финальная прогулка по Панфиловскому парку", place: "Панфиловский парк", address: "ул. Гоголя, 40" },

        { day: 6, distance: "15 км", time: "08:00–11:00", event: "Заключительный переход по южной части Алматы", place: "Район Аль-Фараби", address: "южная часть города" },
        { day: '', distance: "", time: "11:30–14:00", event: "Набережная реки Большая Алматинка", place: "Набережная реки Большая Алматинка", address: "ул. Сатпаева" },
        { day: '', distance: "", time: "14:30–18:00", event: "Отдых в парке Баумана", place: "Парк Баумана", address: "ул. Бекмаханова" },
    ],
    [
        { day: 1, distance: "18 км", time: "09:00–12:00", event: "Старт: Панфиловский парк → Вознесенский собор", place: "Панфиловский парк", address: "ул. Гоголя, 40" },
        { day: '', distance: "", time: "12:30–14:00", event: "Музей народных инструментов → Зеленый базар", place: "Музей народных инструментов", address: "ул. Зенкова, 24" },

        { day: 2, distance: "20 км", time: "08:00–12:00", event: "Пеший переход в Старый центр Алматы", place: "Район Старого центра", address: "проспект Абылай хана и его окрестности" },
        { day: '', distance: "", time: "12:30–14:00", event: "Музей истории Алматы", place: "Музей истории Алматы", address: "ул. Толе би, 59" },
        { day: '', distance: "", time: "14:30–18:00", event: "Посещение кинотеатра Целинный и прогулка по Арбату", place: "Кинотеатр Целинный", address: "ул. Кунаева, 82" },

        { day: 3, distance: "19 км", time: "08:00–12:00", event: "Пеший маршрут к Алматинскому зоопарку", place: "Алматинский зоопарк", address: "ул. Есенберлина, 166" },
        { day: '', distance: "", time: "12:30–14:00", event: "Прогулка в парке Горького", place: "Парк Горького", address: "ул. Гоголя, 1" },
        { day: '', distance: "", time: "14:30–18:00", event: "Посещение Казахского национального музея", place: "Казахский национальный музей", address: "проспект Назарбаева, 44" },

        { day: 4, distance: "18 км", time: "08:00–12:00", event: "Переход в район площади Республики", place: "Площадь Республики", address: "проспект Достык, 56" },
        { day: '', distance: "", time: "12:30–14:00", event: "Национальная библиотека", place: "Национальная библиотека", address: "ул. Абая, 14" },
        { day: '', distance: "", time: "14:30–18:00", event: "Проспект Абая → Пешеходная улица Панфилова", place: "Проспект Абая", address: "центральная улица Алматы" },

        { day: 5, distance: "22 км", time: "08:00–12:00", event: "Переход через музей Кастеева", place: "ГМИ имени Кастеева", address: "ул. Кастеева, 30А" },
        { day: '', distance: "", time: "12:30–14:00", event: "Поход в район Самал", place: "Район Самал", address: "улицы Тимирязева и Назарбаева" },
        { day: '', distance: "", time: "14:30–18:00", event: "Переход к мосту на Есентай-реке", place: "Мост через реку Есентай", address: "проспект Аль-Фараби" },

        { day: 6, distance: "15 км", time: "08:00–12:00", event: "Финальная прогулка по парку Президента", place: "Парк Первого Президента", address: "проспект Аль-Фараби, 53" },
        { day: '', distance: "", time: "12:30–14:00", event: "Обзор панорамных видов на город", place: "Смотровая площадка Медеу", address: "—" },
        { day: '', distance: "", time: "14:30–18:00", event: "Завершение маршрута в Центральном парке", place: "Центральный парк", address: "ул. Гоголя, 1" }
    ],
    [
        { day: 1, distance: "17 км", time: "09:00-12:00", event: "Старт в Казахской государственной филармонии", place: "Филармония имени Жамбыла", address: "ул. Калдаякова, 35" },
        { day: '', distance: "", time: "12:30-14:00", event: "Музей Кунаева", place: "Дом-музей Д. Кунаева", address: "проспект Достык, 105" },
        { day: '', distance: "", time: "14:30-18:00", event: "Театр оперы и балета", place: "ГАТОБ имени Абая", address: "проспект Абылай хана, 110" },

        { day: 2, distance: "20 км", time: "08:00-12:00", event: "Пешеходная прогулка по литературному Арбату", place: "Арбат Алматы", address: "проспект Жибек Жолы" },
        { day: '', distance: "", time: "12:30-14:00", event: "Музей казахской литературы", place: "Музей литературы", address: "ул. Панфилова, 92" },
        { day: '', distance: "", time: "14:30-18:00", event: "Галерея современного искусства", place: "Галерея Арт-Центр", address: "ул. Кунаева, 83" },

        { day: 3, distance: "19 км", time: "08:00-12:00", event: "Переход в сторону художественной академии", place: "КазНАИ имени Жургенова", address: "проспект Абылай хана, 108" },
        { day: '', distance: "", time: "12:30-14:00", event: "Центральная городская библиотека", place: "ЦГБ имени И. Омарова", address: "ул. Абая, 47" },
        { day: '', distance: "", time: "14:30-18:00", event: "Музей изобразительного искусства", place: "ГМИ имени Кастеева", address: "ул. Кастеева, 30А" },

        { day: 4, distance: "18 км", time: "08:00-12:00", event: "Посещение театра Лермонтова", place: "Театр Лермонтова", address: "проспект Абылай хана, 43" },
        { day: '', distance: "", time: "12:30-14:00", event: "Галерея современного искусства", place: "ArtPoint Gallery", address: "проспект Достык, 78" },
        { day: '', distance: "", time: "14:30-18:00", event: "Прогулка по набережной Есентай", place: "Река Есентай", address: "вдоль проспекта Аль-Фараби" }
    ],
    [
        { day: 1, distance: "20 км", time: "09:00–12:00", event: "Пеший подъём на Кок-Тобе", place: "Кок-Тобе", address: "проспект Достык, 1045" },

        { day: 2, distance: "22 км", time: "08:00–12:00", event: "Прогулка до Медеу", place: "Медеу", address: "ул. Горная, 465" },

        { day: 3, distance: "25 км", time: "08:00–12:00", event: "Лыжные трассы в районе Шымбулака", place: "Шымбулак", address: "ул. Горная, 640" },

        { day: 4, distance: "19 км", time: "08:00–12:00", event: "Поход в Бутаковское ущелье", place: "Бутаковское ущелье", address: "окрестности Алматы" },

        { day: 5, distance: "18 км", time: "08:00–12:00", event: "Горный парк «Кокжайлау»", place: "Кокжайлау", address: "территория Национального парка Иле-Алатау" },

        { day: 6, distance: "21 км", time: "08:00–12:00", event: "Завершение маршрута в Алма-Арасан", place: "Алма-Арасан", address: "природный курорт недалеко от Алматы" }
    ]
]

export const tours = [
    { img: president, days: 6, name: 'ГОРНЫЙ ДУХ АЛМАТЫ', tableData: tables[0] },
    { img: medeu, days: 6, name: 'АЛМАТЫ АДРЕНАЛИН', tableData: tables[3] },
    { img: park, days: 6, name: 'АЛМАТЫ СКВОЗЬ ВЕКА', tableData: tables[1] },
    { img: m, days: 4, name: 'АЛМАТЫ - ГОРОД ВДОХНОВЕНИЙ', tableData: tables[2] },
]

export const coord = [[
    [43.2220, 76.9516],
    [43.2629, 76.9432],
    [43.2501, 76.9469],
    [43.25271, 76.94360],
    [43.2611, 76.9422],
    [43.23710, 76.90910],
    [43.2384, 76.9064],
    [43.25271, 76.94360],
],
[
    [43.25271, 76.94360],
    [43.2550, 76.9410],
    [43.2483, 76.9394],
    [43.2592, 76.9431],
    [43.2561, 76.9567],
    [43.2629, 76.9432],
    [43.2523, 76.9428],
],
[
    [43.2505, 76.9493],
    [43.2341, 76.9543],
    [43.2508, 76.9432],
    [43.2611, 76.9422],
    [43.2553, 76.9468],
    [43.2576, 76.9445],
],
[
    [43.23710, 76.90910],
    [43.20291, 76.93490],
    [43.2200, 76.9300],
    [43.2500, 76.9200],
    [43.18598, 77.06448],
    [43.15660, 77.08060],
]
]